ZetaWeb.Exchange/src/Catalogs/зс_веб_ОбъектыОбмена/зс_веб_ОбъектыОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зс_веб_ОбъектыОбмена</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОбъекта</name>
    <comment>Например, Спр, Док, ТЧ и т.д.</comment>
    <type>
      <types>EnumRef.ЗетаWEBТипыОбъектовКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительскийОбъектОбмена</name>
    <type>
      <types>CatalogRef.зс_веб_ОбъектыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьОбъектССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПланаОбмена</name>
    <type>
      <types>EnumRef.зс_веб_ИменаПлановОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <comment>Истина - объект конфигурации, ложь - объект CMS</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКонфигурации</name>
    <comment>Нужен для перехода на новую систему обмена</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбмене</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаПоддержке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ZetaWeb.Exchange/src/Enums/ЗетаWEBТипыОбъектовКонфигурации/ЗетаWEBТипыОбъектовКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗетаWEBТипыОбъектовКонфигурации</name>
  <enumValues>
    <name>Спр</name>
    <comment>Справочник</comment>
  </enumValues>
  <enumValues>
    <name>Док</name>
    <comment>Документ</comment>
  </enumValues>
  <enumValues>
    <name>ПВХ</name>
    <comment>План видов характеристик</comment>
  </enumValues>
  <enumValues>
    <name>РегНак</name>
    <comment>Регистр накопления</comment>
  </enumValues>
  <enumValues>
    <name>РегСв</name>
    <comment>Регистр сведений</comment>
  </enumValues>
  <enumValues>
    <name>ТЧ</name>
    <comment>Табличная часть</comment>
  </enumValues>
</mdclass:Enum>

ZetaWeb.Exchange/src/Catalogs/зс_веб_ОбъектыОбмена/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипОбъекта = Перечисления.ЗетаWEBТипыОбъектовКонфигурации.ТЧ Тогда
		
		ПроверяемыеРеквизиты.Добавить("РодительскийОбъектОбмена");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
	
		Если ПустаяСтрока(ИмяМетаданныхНаСайте) Тогда
			
			Отказ = Истина;
			
			зс_веб_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено имя метаданных для сайта");
			
		КонецЕсли;
		
		Если ИмяПланаОбмена = Перечисления.зс_веб_ИменаПлановОбмена.ПустаяСсылка() Тогда
			
			Отказ = Истина;
			
			зс_веб_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан план обмена");
			
		КонецЕсли;
		
		Если ТипОбъекта = Перечисления.ЗетаWEBТипыОбъектовКонфигурации.Спр Тогда
			
			ТипОбъектаСтрокой = "Спр";
			
		ИначеЕсли ТипОбъекта = Перечисления.ЗетаWEBТипыОбъектовКонфигурации.Док Тогда
			
			ТипОбъектаСтрокой = "Док";
			
		ИначеЕсли ТипОбъекта = Перечисления.ЗетаWEBТипыОбъектовКонфигурации.ПВХ Тогда
			
			ТипОбъектаСтрокой = "ПВХ";
			
		ИначеЕсли ТипОбъекта = Перечисления.ЗетаWEBТипыОбъектовКонфигурации.РегНак Тогда
			
			ТипОбъектаСтрокой = "РегНак";
		
		ИначеЕсли ТипОбъекта = Перечисления.ЗетаWEBТипыОбъектовКонфигурации.РегСв Тогда
			
			ТипОбъектаСтрокой = "РегСв";
			
		ИначеЕсли ТипОбъекта = Перечисления.ЗетаWEBТипыОбъектовКонфигурации.ТЧ Тогда
			
			ТипОбъектаСтрокой = "ТЧ";
			
		Иначе
			
			ТипОбъектаСтрокой = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
